import React, { PureComponent } from 'react';

export class CloseIcon extends PureComponent {
    render() {
        const {
            width,
            height,
        } = this.props;
        return (
            <svg width={width} height={height} viewBox="0 0 40 40" version="1.1" xmlns="http://www.w3.org/2000/svg" xlink="http://www.w3.org/1999/xlink">
                <g id="楼盘信息管理" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
                    <g id="楼盘信息管理-查看楼盘/楼层房间/查看更多图片" transform="translate(-1116.000000, -152.000000)" fill="#cbcbcb">
                        <g id="Group-16">
                            <g id="Group-14" transform="translate(201.000000, 152.000000)">
                                <g id="Group-57" transform="translate(915.000000, 0.000000)">
                                    <path d="M20,40 C8.954305,40 0,31.045695 0,20 C0,8.954305 8.954305,0 20,0 C31.045695,0 40,8.954305 40,20 C40,31.045695 31.045695,40 20,40 Z M20,22.6516504 L24.4194174,27.0710678 C25.1516504,27.8033009 26.3388348,27.8033009 27.0710678,27.0710678 C27.8033009,26.3388348 27.8033009,25.1516504 27.0710678,24.4194174 L22.6516504,20 L27.0710678,15.5805826 C27.8033009,14.8483496 27.8033009,13.6611652 27.0710678,12.9289322 C26.3388348,12.1966991 25.1516504,12.1966991 24.4194174,12.9289322 L20,17.3483496 L15.5805826,12.9289322 C14.8483496,12.1966991 13.6611652,12.1966991 12.9289322,12.9289322 C12.1966991,13.6611652 12.1966991,14.8483496 12.9289322,15.5805826 L17.3483496,20 L12.9289322,24.4194174 C12.1966991,25.1516504 12.1966991,26.3388348 12.9289322,27.0710678 C13.6611652,27.8033009 14.8483496,27.8033009 15.5805826,27.0710678 L20,22.6516504 Z" id="ic-view-picture-forknumber"></path>
                                </g>
                            </g>
                        </g>
                    </g>
                </g>
            </svg>
        );
    }
};

export class ImageShowCloseIcon extends PureComponent {
    render() {
        return (
            <svg width='100%' height='100%' viewBox="0 0 40 40" version="1.1" xmlns="http://www.w3.org/2000/svg">
                <g id="楼盘信息管理" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
                    <g id="楼盘信息管理-查看楼盘/楼层房间/查看更多图片" transform="translate(-1116.000000, -152.000000)" fill="#FFFFFF">
                        <g id="Group-16">
                            <g id="Group-14" transform="translate(201.000000, 152.000000)">
                                <g id="Group-57" transform="translate(915.000000, 0.000000)">
                                    <path d="M20,40 C8.954305,40 0,31.045695 0,20 C0,8.954305 8.954305,0 20,0 C31.045695,0 40,8.954305 40,20 C40,31.045695 31.045695,40 20,40 Z M20,22.6516504 L24.4194174,27.0710678 C25.1516504,27.8033009 26.3388348,27.8033009 27.0710678,27.0710678 C27.8033009,26.3388348 27.8033009,25.1516504 27.0710678,24.4194174 L22.6516504,20 L27.0710678,15.5805826 C27.8033009,14.8483496 27.8033009,13.6611652 27.0710678,12.9289322 C26.3388348,12.1966991 25.1516504,12.1966991 24.4194174,12.9289322 L20,17.3483496 L15.5805826,12.9289322 C14.8483496,12.1966991 13.6611652,12.1966991 12.9289322,12.9289322 C12.1966991,13.6611652 12.1966991,14.8483496 12.9289322,15.5805826 L17.3483496,20 L12.9289322,24.4194174 C12.1966991,25.1516504 12.1966991,26.3388348 12.9289322,27.0710678 C13.6611652,27.8033009 14.8483496,27.8033009 15.5805826,27.0710678 L20,22.6516504 Z" id="ic-view-picture-forknumber"></path>
                                </g>
                            </g>
                        </g>
                    </g>
                </g>
            </svg>
        );
    }
};

export class ImageShowCtrlIcon extends PureComponent {
    render() {
        return (
            <svg width="100%" height="100%" viewBox="0 0 20 32" version="1.1" xmlns="http://www.w3.org/2000/svg">
                <g id="楼盘信息管理" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
                    <g id="楼盘信息管理-查看楼盘/楼层房间/查看更多图片" transform="translate(-1170.000000, -496.000000)" fill="#FFFFFF">
                        <g id="Group-16">
                            <g id="Group-14" transform="translate(201.000000, 152.000000)">
                                <g id="ic-view-picture-arrow" transform="translate(972.500000, 360.500000) scale(-1, 1) translate(-972.500000, -360.500000) translate(955.000000, 343.000000)">
                                    <g id="Group-55" transform="translate(17.213203, 17.213203) rotate(-315.000000) translate(-17.213203, -17.213203) translate(5.213203, 5.213203)">
                                        <path d="M5.76,18.24 L21.12,18.24 C22.7105801,18.24 24,19.5294199 24,21.12 C24,22.7105801 22.7105801,24 21.12,24 L3.2,24 C1.4326888,24 5.47117907e-13,22.5673112 5.47117907e-13,20.8 L5.47117907e-13,18.24 L1.27320376e-12,2.88 C1.27300897e-12,1.28941992 1.28941992,-9.09202517e-13 2.88,-9.09494702e-13 C4.47058008,-9.09786887e-13 5.76,1.28941992 5.76,2.88 L5.76,18.24 Z" id="Combined-Shape"></path>
                                    </g>
                                </g>
                            </g>
                        </g>
                    </g>
                </g>
            </svg>
        );
    }
};